




3个主要模块:

    1. 获取数据并计算价差率
        待优化:
            - 左右腿时间戳问题 (解决现货盘口时间戳问题)

    2. 简易下单:
        问题:
            1. 未设置保险机制: 下单前没有检测账户是否有余额 # 所以每次开单前都需要人工计算开单量...比较麻烦而且容易出错
            2. 当出现单边下单失败的时候, 应该立马停止程序 # 防止伤害扩大
            3. 在大量开仓某个币种的时候, 一定要主要合约账户的杠杠倍数和最大仓位的关系!!
                # 即: 一定要注意当前杠杆能开的最大仓位是多少! 尽量让杠杆不要开太大, 5-10倍是比较合理的!!
                (被这个问题坑了好多次了!!!)
            4. 下单的核心数据内容要记录到一个df大表中 (动态的)
            5. 所有操作都应该记录到log日志文件中 (持久化, 便于后期分析问题)

    3. 检验实际下单价差率
























#
